<a href="https://colab.research.google.com/github/p1tuo/20201104-work/blob/main/Untitled8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
import pandas as pd
import numpy as np

In [12]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [13]:
data

a  1    0.318758
   2   -0.717836
   3   -0.349951
b  1   -0.716262
   3   -0.761873
c  1   -0.060327
   2    0.118221
d  2   -0.673127
   3    0.820549
dtype: float64

In [14]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [15]:
data['b']

1   -0.716262
3   -0.761873
dtype: float64

In [16]:
data['b': 'c']

b  1   -0.716262
   3   -0.761873
c  1   -0.060327
   2    0.118221
dtype: float64

In [17]:
data.loc[['b', 'd']]

b  1   -0.716262
   3   -0.761873
d  2   -0.673127
   3    0.820549
dtype: float64

In [18]:
data.loc[:, 2]

a   -0.717836
c    0.118221
d   -0.673127
dtype: float64

In [19]:
data.unstack()

          1         2         3
a  0.318758 -0.717836 -0.349951
b -0.716262       NaN -0.761873
c -0.060327  0.118221       NaN
d       NaN -0.673127  0.820549

In [20]:
data.unstack().stack()

a  1    0.318758
   2   -0.717836
   3   -0.349951
b  1   -0.716262
   3   -0.761873
c  1   -0.060327
   2    0.118221
d  2   -0.673127
   3    0.820549
dtype: float64

In [21]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [22]:
frame.index.names = ['key1', 'key2']

In [23]:
frame.columns.names = ['state', 'color']

In [24]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [25]:
frame [ 'Ohio' ]

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [26]:
pd . MultiIndex . from_arrays ([[ 'Ohio' ,  'Ohio' ,  'Colorado' ],  [ 'Green' ,  'Red' ,  'Green' ]], 
                      names = [ 'state' ,  'color' ])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [27]:
frame . swaplevel ( 'key1' ,  'key2' )

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [28]:
frame . sort_index ( level = 1 )

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [29]:
frame . sort_index ( level = 'key2' )

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [30]:
frame . swaplevel ( 0 ,  1 ) . sort_index ( level = 0 )

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [31]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [32]:
frame . sum ( level = 'key2' )

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [33]:
frame . sum ( level = 'key2' )

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [34]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [35]:
frame2  =  frame . set_index ([ 'c' ,  'd' ]) 
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [36]:
frame . set_index ([ 'c' ,  'd' ],  drop = False )

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [37]:
frame2 . reset_index ()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1